# 1. Написати програму, яка вміє переводити температуру з C в Фаренгетів і Кельвінів Наприклад:
# дана температура в Цельсіях 25 С
#
# Фаренгейт: 45.9F - вважається за формулою (C+32) * 5/9
#
# Кельвіни: 298.16K - вважається за формулою C + 273.16
#
#
#
# Користувач вводить температуру в градусах Цельсіях, програма выводить температуру в
# Фаренгейтах та Кельвінах
print('Задание №1\n')

try:
    celsius = int(input('Введите значение температуры в Цельсиях: '))
    # Формула (°C × 9/5) + 32 = °F?, формула из домашки (°C+32) * 5/9 = °F
    fahrenheit = (celsius + 32) * 5 / 9
    kelvins = celsius + 273.16
    print(f'{celsius} градусов Цельсия равняется:\n'
          f'{fahrenheit} в Фаренгейте\n'
          f'{kelvins} в Кельвинах')
except Exception as ex:
    print(ex)

# 2.Змішано V1 літрів води з температурою T1 та V2 літрів з температурою T2.
# Написати програму, яка порахує об'єм і температуру суміші,
# що вийшла обчислюється за формулою (v1*t1 + v2*t2) / (v1 + v2)
#
# Всі параметри виводяться в консолі, вивести обьєм та температуру
print('\nЗадание №2\n')

try:
    v1 = int(input('Первый объем воды '))
    t1 = int(input('Первая температура: '))
    v2 = int(input('Второй обхем воды: '))
    t2 = int(input('Вторая температура: '))
    result = (v1 * t1 + v2 * t2) / (v1 + v2)
    print(f'Объем и температу смеси: {result}')
except Exception as ex:
    print(ex)


# 3. Написати програму для підрахунку конвертації валюти: UAH --> USD
#
# USD --> UAH
#
# UAH --> EUR
#
# EUR --> UAH
print('\nЗадание №3\n')

try:
    uah_to_usd = int(input('Введите значение UAH для перевода в USD: '))
    # Курс гривны к доллару взял 37 к 1
    print(f'{uah_to_usd} гривен --> {uah_to_usd / 37} USD')

    usd_to_uah = int(input('Введите значение USD для перевода в UAH: '))
    # Курс доллара к гривне взял 1 к 37
    print(f'{usd_to_uah} USD --> {usd_to_uah * 37} гривен')

    uah_to_eur = int(input('Введите значение UAH для перевода в EUR: '))
    # Курс гривны к евро взял 41 к 1
    print(f'{uah_to_eur} гривен --> {uah_to_eur / 41} EUR')

    eur_to_uah = int(input('Введите значение EUR для перевода в UAH: '))
    # Курс евро к гривне взял 1 к 41
    print(f'{eur_to_uah} EUR --> {eur_to_uah * 41} гривен')
except Exception as ex:
    print(ex)


# 4.Написать калькулятор с основными операциями(+, -, *, /)
#
# Користувач вводить два числа та арефметичну операцію
print('\nЗадание №4\n')

try:
    num_1 = int(input('Введите превое число: '))
    num_2 = int(input('Введите второе число: '))
    operation = input('Допустимые операции: +, -, *, / \n'
                      'Укажите операцию которую вы хотите совершить с числами: ')
    print(f'Ваша задача: {num_1}{operation}{num_2}')
    if operation == '+':
        print(f'Ответ{num_1+num_2}')
    elif operation == '-':
        print(f'Ответ{num_1-num_2}')
    elif operation == '*':
        print(f'Ответ{num_1*num_2}')
    elif operation == '/':
        print(f'Ответ{num_1/num_2}')
except Exception as ex:
    print(ex)
